espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/kit/common/drivers/cdc.c
/***************************************************************************//**
 * @file
 * @brief Gecko USB Communication Device Class (CDC) driver.
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/
#include "em_device.h"
#include "em_common.h"
#include "em_cmu.h"
#include "em_core.h"
#include "em_dma.h"
#include "em_gpio.h"
#include "em_usart.h"
#include "em_usb.h"
#include "bsp.h"
#include "dmactrl.h"
#include "cdc.h"

/* *INDENT-OFF* */

/***************************************************************************//**
 * @addtogroup kitdrv
 * @{
 ******************************************************************************/

/**************************************************************************//**
 * @addtogroup gusbcdc Gecko USB RS232 bridge
 * @brief Gecko USB to RS232 bridge (CDC Class).
 *
 * @details

   @section cdc_intro CDC Implementation

   This driver implements a basic USB to RS232 bridge.

   @section cdc_config CDC Device Configuration Options

   This section contains a description of the configuration options for
   the driver. The options are @htmlonly #defines @endhtmlonly which are
   expected to be found in the application "usbconfig.h" header file.
   The values shown below are from the Giant Gecko DK3750 CDC example.

   @verbatim
 // USB interface numbers. Interfaces are numbered from zero to one less than
 // the number of concurrent interfaces supported by the configuration. A CDC
 // device is by itself a composite device and has two interfaces.
 // The interface numbers must be 0 and 1 for a standalone CDC device, for a
 // composite device which includes a CDC interface it must not be in conflict
 // with other device interfaces.
 #define CDC_CTRL_INTERFACE_NO ( 0 )
 #define CDC_DATA_INTERFACE_NO ( 1 )

 // Endpoint address for CDC data reception.
 #define CDC_EP_DATA_OUT ( 0x01 )

 // Endpoint address for CDC data transmission.
 #define CDC_EP_DATA_IN ( 0x81 )

 // Endpoint address for the notification endpoint (not used).
 #define CDC_EP_NOTIFY ( 0x82 )

 // Timer id, see USBTIMER in the USB device stack documentation.
 // The CDC driver has a Rx timeout functionality which require a timer.
 #define CDC_TIMER_ID ( 0 )

 // DMA related macros, select DMA channels and DMA request signals.
 #define CDC_UART_TX_DMA_CHANNEL   ( 0 )
 #define CDC_UART_RX_DMA_CHANNEL   ( 1 )
 #define CDC_TX_DMA_SIGNAL         DMAREQ_UART1_TXBL
 #define CDC_RX_DMA_SIGNAL         DMAREQ_UART1_RXDATAV

 // UART/USART selection macros.
 #define CDC_UART                  UART1
 #define CDC_UART_CLOCK            cmuClock_UART1
 #define CDC_UART_ROUTE            ( UART_ROUTE_RXPEN | UART_ROUTE_TXPEN | \
                                    UART_ROUTE_LOCATION_LOC2 )
 #define CDC_UART_TX_PORT          gpioPortB
 #define CDC_UART_TX_PIN           9
 #define CDC_UART_RX_PORT          gpioPortB
 #define CDC_UART_RX_PIN           10

 // Activate the RS232 switch on DKs.
 #define CDC_ENABLE_DK_UART_SWITCH() BSP_PeripheralAccess(BSP_RS232_UART, true)

 // No RS232 switch on STKs. Leave the definition "empty".
 #define CDC_ENABLE_DK_UART_SWITCH()

   @endverbatim
 * @{
 ******************************************************************************/

/* *INDENT-ON* */

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

/*** Typedes and defines ***/

#define CDC_BULK_EP_SIZE  (USB_FS_BULK_EP_MAXSIZE) /* This is the max. ep size.    */
#define CDC_USB_RX_BUF_SIZ  CDC_BULK_EP_SIZE /* Packet size when receiving on USB. */
#define CDC_USB_TX_BUF_SIZ  127    /* Packet size when transmitting on USB.  */

/* Calculate a timeout in ms corresponding to 5 char times on current     */
/* baudrate. Minimum timeout is set to 10 ms.                             */
#define CDC_RX_TIMEOUT    SL_MAX(10U, 50000 / (cdcLineCoding.dwDTERate))

/* The serial port LINE CODING data structure, used to carry information  */
/* about serial port baudrate, parity etc. between host and device.       */
SL_PACK_START(1)
typedef struct {
  uint32_t dwDTERate;               /** Baudrate                            */
  uint8_t  bCharFormat;             /** Stop bits, 0=1 1=1.5 2=2            */
  uint8_t  bParityType;             /** 0=None 1=Odd 2=Even 3=Mark 4=Space  */
  uint8_t  bDataBits;               /** 5, 6, 7, 8 or 16                    */
  uint8_t  dummy;                   /** To ensure size is a multiple of 4 bytes */
} SL_ATTRIBUTE_PACKED cdcLineCoding_TypeDef;
SL_PACK_END()

/*** Function prototypes ***/

static int  UsbDataReceived(USB_Status_TypeDef status, uint32_t xferred,
                            uint32_t remaining);
static void DmaSetup(void);
static int  LineCodingReceived(USB_Status_TypeDef status,
                               uint32_t xferred,
                               uint32_t remaining);
static void SerialPortInit(void);
static void UartRxTimeout(void);

