espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/kit/common/drivers/cdc.c
      /* Start a new USB receive transfer. */
      USBD_Read(CDC_EP_DATA_OUT, (void*) usbRxBuffer[usbRxIndex],
                CDC_USB_RX_BUF_SIZ, UsbDataReceived);
    } else {
      /* The UART transmit DMA callback function will start a new DMA. */
      usbRxActive      = false;
      usbBytesReceived = xferred;
    }
  }
  return USB_STATUS_OK;
}

/**************************************************************************//**
 * @brief Callback function called whenever a UART transmit DMA has completed.
 *
 * @param[in] channel DMA channel number.
 * @param[in] primary True if this is the primary DMA channel.
 * @param[in] user    Optional user supplied parameter.
 *****************************************************************************/
static void DmaTxComplete(unsigned int channel, bool primary, void *user)
{
  (void) channel;              /* Unused parameter. */
  (void) primary;              /* Unused parameter. */
  (void) user;                 /* Unused parameter. */
  CORE_DECLARE_IRQ_STATE;

  /*
   * As nested interrupts may occur and we rely on variables usbRxActive
   * and dmaTxActive etc, we must handle this function as a critical region.
   */
  CORE_ENTER_ATOMIC();

  if (!usbRxActive) {
    /* usbRxActive = false means that an USB receive packet has been received.*/
    DMA_ActivateBasic(CDC_UART_TX_DMA_CHANNEL, true, false,
                      (void *) &(CDC_UART->TXDATA),
                      (void *) usbRxBuffer[usbRxIndex ^ 1],
                      usbBytesReceived - 1);

    /* Start a new USB receive transfer. */
    usbRxActive = true;
    USBD_Read(CDC_EP_DATA_OUT, (void*) usbRxBuffer[usbRxIndex],
              CDC_USB_RX_BUF_SIZ, UsbDataReceived);
  } else {
    /* The USB receive complete callback function will start a new DMA. */
    dmaTxActive = false;
  }

  CORE_EXIT_ATOMIC();
}

/**************************************************************************//**
 * @brief Callback function called whenever a packet with data has been
 *        transmitted on USB
 *
 * @param[in] status    Transfer status code.
 * @param[in] xferred   Number of bytes transferred.
 * @param[in] remaining Number of bytes not transferred.
 *
 * @return USB_STATUS_OK.
 *****************************************************************************/
static int UsbDataTransmitted(USB_Status_TypeDef status,
                              uint32_t xferred,
                              uint32_t remaining)
{
  (void) xferred;              /* Unused parameter. */
  (void) remaining;            /* Unused parameter. */

  if (status == USB_STATUS_OK) {
    if (!dmaRxActive) {
      /* dmaRxActive = false means that a new UART Rx DMA can be started. */

      USBD_Write(CDC_EP_DATA_IN, (void*) uartRxBuffer[uartRxIndex ^ 1],
                 uartRxCount, UsbDataTransmitted);
      LastUsbTxCnt = uartRxCount;

      dmaRxActive    = true;
      dmaRxCompleted = true;
      DMA_ActivateBasic(CDC_UART_RX_DMA_CHANNEL, true, false,
                        (void *) uartRxBuffer[uartRxIndex],
                        (void *) &(CDC_UART->RXDATA),
                        CDC_USB_TX_BUF_SIZ - 1);
      uartRxCount = 0;
      USBTIMER_Start(CDC_TIMER_ID, CDC_RX_TIMEOUT, UartRxTimeout);
    } else {
      /* The UART receive DMA callback function will start a new DMA. */
      usbTxActive = false;
    }
  }
  return USB_STATUS_OK;
}

/**************************************************************************//**
 * @brief Callback function called whenever a UART receive DMA has completed.
 *
 * @param[in] channel DMA channel number.
 * @param[in] primary True if this is the primary DMA channel.
 * @param[in] user    Optional user supplied parameter.
 *****************************************************************************/
static void DmaRxComplete(unsigned int channel, bool primary, void *user)
{
  (void) channel;              /* Unused parameter. */
  (void) primary;              /* Unused parameter. */
  (void) user;                 /* Unused parameter. */
  CORE_DECLARE_IRQ_STATE;

  /*
   * As nested interrupts may occur and we rely on variables usbTxActive
   * and dmaRxActive etc, we must handle this function as a critical region.
   */
  CORE_ENTER_ATOMIC();

  uartRxIndex ^= 1;

  if (dmaRxCompleted) {
    uartRxCount = CDC_USB_TX_BUF_SIZ;
  } else {
    uartRxCount = CDC_USB_TX_BUF_SIZ - 1
                  - ((dmaControlBlock[1].CTRL & _DMA_CTRL_N_MINUS_1_MASK)
                     >> _DMA_CTRL_N_MINUS_1_SHIFT);
  }

  if (!usbTxActive) {
    /* usbTxActive = false means that a new USB packet can be transferred. */
    usbTxActive = true;
    USBD_Write(CDC_EP_DATA_IN, (void*) uartRxBuffer[uartRxIndex ^ 1],
               uartRxCount, UsbDataTransmitted);
    LastUsbTxCnt = uartRxCount;

    /* Start a new UART receive DMA. */
    dmaRxCompleted = true;
    DMA_ActivateBasic(CDC_UART_RX_DMA_CHANNEL, true, false,
                      (void *) uartRxBuffer[uartRxIndex],
                      (void *) &(CDC_UART->RXDATA),
                      CDC_USB_TX_BUF_SIZ - 1);
    uartRxCount = 0;
    USBTIMER_Start(CDC_TIMER_ID, CDC_RX_TIMEOUT, UartRxTimeout);
  } else {
    /* The USB transmit complete callback function will start a new DMA. */
    dmaRxActive = false;
    USBTIMER_Stop(CDC_TIMER_ID);
  }

  CORE_EXIT_ATOMIC();
}

/**************************************************************************//**
 * @brief
 *   Called each time UART Rx timeout period elapses.
 *   Implements UART Rx rate monitoring, i.e. we must behave differently when
 *   UART Rx rate is slow e.g. when a person is typing characters, and when UART
 *   Rx rate is maximum.
 *****************************************************************************/
static void UartRxTimeout(void)
{
  int      cnt;
  uint32_t dmaCtrl;

  dmaCtrl = dmaControlBlock[1].CTRL;

  /* Has the DMA just completed ? */
  if ((dmaCtrl & _DMA_CTRL_CYCLE_CTRL_MASK) == DMA_CTRL_CYCLE_CTRL_INVALID) {
    return;
  }

  cnt = CDC_USB_TX_BUF_SIZ - 1
        - ((dmaCtrl & _DMA_CTRL_N_MINUS_1_MASK) >> _DMA_CTRL_N_MINUS_1_SHIFT);

  if ((cnt == 0) && (LastUsbTxCnt == CDC_BULK_EP_SIZE)) {
    /*
     * No activity on UART Rx, send a ZERO length USB package if last USB
     * USB package sent was CDC_BULK_EP_SIZE (max. EP size) long.
     */
    /* Stop Rx DMA channel. */
    DMA->CHENC     = 1 << CDC_UART_RX_DMA_CHANNEL;
    dmaRxCompleted = false;
    /* Call DMA completion callback. */
    DmaRxComplete(CDC_UART_RX_DMA_CHANNEL, true, NULL);
    return;
  }

