espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/kit/common/drivers/cdc.c
  if ((cnt > 0) && (cnt == uartRxCount)) {
    /*
     * There is curently no activity on UART Rx but some chars have been
     * received. Stop DMA and transmit the chars we have got so far on USB.
     */
    /* Stop Rx DMA channel. */
    DMA->CHENC     = 1 << CDC_UART_RX_DMA_CHANNEL;
    dmaRxCompleted = false;
    /* Call DMA completion callback. */
    DmaRxComplete(CDC_UART_RX_DMA_CHANNEL, true, NULL);
    return;
  }

  /* Restart timer to continue monitoring. */
  uartRxCount = cnt;
  USBTIMER_Start(CDC_TIMER_ID, CDC_RX_TIMEOUT, UartRxTimeout);
}

/**************************************************************************//**
 * @brief
 *   Callback function called when the data stage of a CDC_SET_LINECODING
 *   setup command has completed.
 *
 * @param[in] status    Transfer status code.
 * @param[in] xferred   Number of bytes transferred.
 * @param[in] remaining Number of bytes not transferred.
 *
 * @return USB_STATUS_OK if data accepted.
 *         USB_STATUS_REQ_ERR if data calls for modes we can not support.
 *****************************************************************************/
static int LineCodingReceived(USB_Status_TypeDef status,
                              uint32_t xferred,
                              uint32_t remaining)
{
  uint32_t frame = 0;
  (void) remaining;

  /* We have received new serial port communication settings from USB host. */
  if ((status == USB_STATUS_OK) && (xferred == 7)) {
    /* Check bDataBits, valid values are: 5, 6, 7, 8 or 16 bits. */
    if (cdcLineCoding.bDataBits == 5) {
      frame |= USART_FRAME_DATABITS_FIVE;
    } else if (cdcLineCoding.bDataBits == 6) {
      frame |= USART_FRAME_DATABITS_SIX;
    } else if (cdcLineCoding.bDataBits == 7) {
      frame |= USART_FRAME_DATABITS_SEVEN;
    } else if (cdcLineCoding.bDataBits == 8) {
      frame |= USART_FRAME_DATABITS_EIGHT;
    } else if (cdcLineCoding.bDataBits == 16) {
      frame |= USART_FRAME_DATABITS_SIXTEEN;
    } else {
      return USB_STATUS_REQ_ERR;
    }

    /* Check bParityType, valid values are: 0=None 1=Odd 2=Even 3=Mark 4=Space  */
    if (cdcLineCoding.bParityType == 0) {
      frame |= USART_FRAME_PARITY_NONE;
    } else if (cdcLineCoding.bParityType == 1) {
      frame |= USART_FRAME_PARITY_ODD;
    } else if (cdcLineCoding.bParityType == 2) {
      frame |= USART_FRAME_PARITY_EVEN;
    } else if (cdcLineCoding.bParityType == 3) {
      return USB_STATUS_REQ_ERR;
    } else if (cdcLineCoding.bParityType == 4) {
      return USB_STATUS_REQ_ERR;
    } else {
      return USB_STATUS_REQ_ERR;
    }

    /* Check bCharFormat, valid values are: 0=1 1=1.5 2=2 stop bits */
    if (cdcLineCoding.bCharFormat == 0) {
      frame |= USART_FRAME_STOPBITS_ONE;
    } else if (cdcLineCoding.bCharFormat == 1) {
      frame |= USART_FRAME_STOPBITS_ONEANDAHALF;
    } else if (cdcLineCoding.bCharFormat == 2) {
      frame |= USART_FRAME_STOPBITS_TWO;
    } else {
      return USB_STATUS_REQ_ERR;
    }

    /* Program new UART baudrate etc. */
    CDC_UART->FRAME = frame;
    USART_BaudrateAsyncSet(CDC_UART, 0, cdcLineCoding.dwDTERate, usartOVS16);

    return USB_STATUS_OK;
  }
  return USB_STATUS_REQ_ERR;
}

/**************************************************************************//**
 * @brief Initialize the DMA peripheral.
 *****************************************************************************/
static void DmaSetup(void)
{
  /* DMA configuration structs. */
  DMA_Init_TypeDef       dmaInit;
  DMA_CfgChannel_TypeDef chnlCfgTx, chnlCfgRx;
  DMA_CfgDescr_TypeDef   descrCfgTx, descrCfgRx;

  /* Initialize the DMA. */
  dmaInit.hprot        = 0;
  dmaInit.controlBlock = dmaControlBlock;
  DMA_Init(&dmaInit);

  /*---------- Configure DMA channel for UART Tx. ----------*/

  /* Setup the interrupt callback routine */
  DmaTxCallBack.cbFunc  = DmaTxComplete;
  DmaTxCallBack.userPtr = NULL;

  /* Setup the channel */
  chnlCfgTx.highPri   = false;    /* Can't use with peripherals. */
  chnlCfgTx.enableInt = true;     /* Interrupt needed when buffers are used. */
  chnlCfgTx.select    = CDC_TX_DMA_SIGNAL;
  chnlCfgTx.cb        = &DmaTxCallBack;
  DMA_CfgChannel(CDC_UART_TX_DMA_CHANNEL, &chnlCfgTx);

  /* Setup channel descriptor. */
  /* Destination is UART Tx data register and doesn't move. */
  descrCfgTx.dstInc = dmaDataIncNone;
  descrCfgTx.srcInc = dmaDataInc1;
  descrCfgTx.size   = dmaDataSize1;

  /* We have time to arbitrate again for each sample. */
  descrCfgTx.arbRate = dmaArbitrate1;
  descrCfgTx.hprot   = 0;

  /* Configure primary descriptor. */
  DMA_CfgDescr(CDC_UART_TX_DMA_CHANNEL, true, &descrCfgTx);

  /*---------- Configure DMA channel for UART Rx. ----------*/

  /* Setup the interrupt callback routine. */
  DmaRxCallBack.cbFunc  = DmaRxComplete;
  DmaRxCallBack.userPtr = NULL;

  /* Setup the channel */
  chnlCfgRx.highPri   = false;    /* Can't use with peripherals. */
  chnlCfgRx.enableInt = true;     /* Interrupt needed when buffers are used. */
  chnlCfgRx.select    = CDC_RX_DMA_SIGNAL;
  chnlCfgRx.cb        = &DmaRxCallBack;
  DMA_CfgChannel(CDC_UART_RX_DMA_CHANNEL, &chnlCfgRx);

  /* Setup channel descriptor. */
  /* Source is UART Rx data register and doesn't move. */
  descrCfgRx.dstInc = dmaDataInc1;
  descrCfgRx.srcInc = dmaDataIncNone;
  descrCfgRx.size   = dmaDataSize1;

  /* We have time to arbitrate again for each sample. */
  descrCfgRx.arbRate = dmaArbitrate1;
  descrCfgRx.hprot   = 0;

  /* Configure primary descriptor. */
  DMA_CfgDescr(CDC_UART_RX_DMA_CHANNEL, true, &descrCfgRx);
}

/**************************************************************************//**
 * @brief Initialize the UART peripheral.
 *****************************************************************************/
static void SerialPortInit(void)
{
  USART_InitAsync_TypeDef init  = USART_INITASYNC_DEFAULT;

  /* Configure GPIO pins. */
  CMU_ClockEnable(cmuClock_GPIO, true);
  /* To avoid false start, configure output as high. */
  GPIO_PinModeSet(CDC_UART_TX_PORT, CDC_UART_TX_PIN, gpioModePushPull, 1);
  GPIO_PinModeSet(CDC_UART_RX_PORT, CDC_UART_RX_PIN, gpioModeInput, 0);

  /* Enable DK mainboard RS232/UART switch. */
  CDC_ENABLE_DK_UART_SWITCH();

  /* Enable peripheral clocks. */
  CMU_ClockEnable(cmuClock_HFPER, true);
  CMU_ClockEnable(CDC_UART_CLOCK, true);

  /* Configure UART for basic async operation. */
  init.enable = usartDisable;
  USART_InitAsync(CDC_UART, &init);

  /* Enable Tx/Rx pins and set correct UART location. */
  CDC_UART->ROUTE = CDC_UART_ROUTE;

  /* Finally enable it */
  USART_Enable(CDC_UART, usartEnable);
}

/** @endcond */

/** @} (end group gusbcdc) */
/** @} (end group kitdrv) */
